packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000035a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>35</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T23:09:08.549677+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>pJkWHuKoQmkbVm+Gl72FiG/Q2Qs1vr5qXeZsHL9Ob3u20n/78uYwtDIJDf6qoDNm
xuJ9skG1ONClWLYnlvKABkHBtJUTHriWi2YQWYDMGMSohXFtdexujiNrRJKs1Jt7
XIzYXZotrx/NJ87XU9NJG+lE85VlU3uZgNndl1jM7YaYsTg3pNI6DE133RLt+H3Q
Ey/uooKhnFGv8fuW5NVBltR5kqVNuwdu6RsyiYzRHfL5FPEBWSfoTuGsPo9eRJJN
hODaEWvnsrMId//41rwXbBT8X9cRsVI8FbXM/cIRoPiAALz+a9aHBDMeiCa+8p6h
jqMCXKQZWcTpsLjgqL4TAQ==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>nS9HdUz5+ky2AYtrymGQiFr/6nSxvuwQg5YaAo3xMhIevBns0kOAzH0Ax5l3gqrZ
5cqbuvSvaPjc4qWhqJ2F+7Twi5ej64xCWcwYCxuV3bdFm+KLqRLVvl5AVRPNvXyD
DQSYm7QMInxGzY++GNGuX4eHoFADWvwZ0EYQfZ2Qd6qK5HOoQoAOpIM2UZWUuKYI
95G6JkSNa+C7Dblrt2q5IVYRfZIBgKOnRunlg2Ik5TIl+3LaxyJDT1+GBgzgMrmQ
5DPy1NwmOhlGcgYVzLYeKF/hA2vOiTlC4urX2mhKIoCnoqm+xLmrL8BylS+SZoiu
8q+Z+s+o9gojNQcAgbT6+dc+CHqXJtUAIXh12iwvTSp6XeKwYoryRUJIRv2/Md6q
iBug/1EOXSj2NHNvwmQXyTmTWS9LMVttlo7MZm0Jv7K66tHfuYscuSKbckksgA3A
nfqRZKdry/hgIDTwOz/j0xGl6UXzLCWEjHKxI2YALj3eX2GOQjGDI6EVEJeV73Cx
CzgUDBhpNo9OhFFvFQywChGJqfSNQccWfU5vDKHP55ElaTixlvbw+PtgOoDulbKo
44awU8jiPVoewVbIVvRsq8kd3CxTY/LMHLgTqyuY2GRJj44ulCupCtyQ4KfKRJ4o
7bnTlYRVaekm3yzS8/C7aJfk+Nvw5H9D4nvmrOTw4mg4ICm+SrCMOKMnjU6SaeKH
kpVQe/MltPyGsMt4Jdt1SLI1fR/7QTud942lJc/OFdeJqA97wvvZOoJVpeGc512q
4mx4FMKLdMjWMN89UoeVUWkHcP0lR16vZ5n5HHpepYa07Y6z+lPcT9PVEktAyQkV
jEPytiaJ12gR9KJMs5qbh+NpUnAjWqP3vNh6/OsTotjpn99/Fv3qYF+PtaA7JMLN
JN2bF6gcDhh5uXoP9qhU/X1XMNPtRLEOidGj66vEU500nC86IBL8aHbCWfG1wMiS
GWYx0ZKbb53HWzzNQHNbQ2AFnu1sQcMkwQW/HafzWNU1MWyhagHfBI+aIK5MnP1h
CRe/Aysr4nEWrpG/QsJmOokStOncHO1CbBuy19zOrNBXj49rkDlZp4P7dfyGqTB8
czeu9BIxV5Kvlgq4HxAizkYBO3ZJyV3CSoUVGLH4VcuqVY0P0U783T0phZOlCMlP
5okxP1Myj3UMgigNJuaZm2l3OI9HLVA6ElDmODGdNyASSYH4wZOSnLqMVxoechyT
Mk+VxhQW0+NIOV7mO2F+V3m+qE2T9nyRe/ARAJptquRH8ZKvirINKBQHc4vSvkEQ
YX66Y7txmgGynSRqZgJaqLlhl60dB/qq9KaYLt6oAIivNL+HXcsM2vEeWS8XdScK
H5jWwqLUtLJP77rC4IvZwqGjSxBXfIk6BAH7Q5IKJMSWZ+7HzpXXL/LBPLN7ZEPo
PMlKvNzUxZrj2VnrrLShVQLg+IZpF8b88xzPPxLZ2qjE2t8lxVnWGCgF7mrHv/0h
R6K9i/25XCp7x+7VbVUMI2q9NSb/3FsA48bIB/GFjCkzdrhLoQE/3Kdvh38QznQR
h9ERnnW069RdVYJg5EVEKB8yt8XncToUKY3kW9Iz5yzp2yuPX/6Rf3mJwZQl7FHA
5DM+Hx1XZWalkoG6S22PHS3rKi7e6D3yjXRyBvcU63FhYrI185j83ReBRVXns3A+
6hTyH5tkoixh5bRUO9Kaxmtsu/7cEJ5tIJ4zbupsisXhEDJ6l0vnoENyenniqoW2
M/HZ9kR2E90g3cawRnz1/WBUFyzMaZL1YzwC56+e80Dc8uUSclxCW9cJjM3t3yA8
47TxmAGZ6tnwQMrxWmrV4oz1V0g5seszIgdctnj/1CPjHwuAzryVXMMdhsFkTk9W
Gfe3LeqtGbzGYbe0vSS8hRyAZ5AEqz10Mizx8gcKQJzfUadUaBRcm3Tyye0anm+D
snK2ym4sIi+0uKVa+3HtKtOyOMJvyF9oaw7YiwwiYoXiNq4xiQ9HxPoOcjwwEHUn
9wZCZtdV0zdHE85zdofjD93w8soCeZ4qaLUf5ZhVsncmMmasWOndPcRthxLe0wbW
0KPBZ7bdTTJEcM0xGzQ9laRTzWdzJXHNwd3RbToI5dyd9Rv2sHIT1V/4xWjj18Cj
eGOvgiQ6Q89ayYRb1KEfLOd0qV+pBK/A29iG3cb/nXFzbapaPrChYzMCaFAch/nY
xcgiNy+fNqImWb5iA8HaHf2lPmUf7t4YrBL+wekci91LWrop0GJE1sN3SM1g1+yf
qMs6O2jJRP1BCCUFflUwLpY/P4HMWo5JHpgNGjlFJt/G8bXV8VTbH6rlDmGlEuha
cJCdWhhrX97tc+OBG9oyu8HHYammAaAiG1aTAaLwjcGxH9s1ui1Ay4LctVRrNiM6
bnCEbXzIiHR3InZSyv3VRpWBfNoPOuFH0U1RtL1GNiVC3cQU/ONrO7AaeMfO5CyY
jHvEWnBsyWEsIAGRDj7DpHUuj5Fd1zfAxLBfA/8/Rzn+ZHvQWVCKPhuTb14lzCxJ
CDh5oBp2y+4O0JloQtfgq/FJ16YW4RhbkI12op14bQVlve+tb4Eku6i+Psft/8+D
FiaptFm7+OYQGm04/iUN9Kc9NpeG7aHDKukGTC+b3+vM6RWOxOXv2x/buAuTynQC
RnhERKmdGO35l7rwDLziWiZmZih6SwWnGTtnl2G8wc6G8z23otEvtYob+RUo21bo
pkLYaTh1SD5IPHmNHLBVkqpjjyRZ82oHjupx9AMFlA6i+yS0RAiYhTAUI8d54u28
fSkU0tKMl5V3Nj2Siw2E66gZHtgbQagZhR5iBZPacDOmTnopE9LoUdcCXxX3cC+6
joTyKr+FChhev1FaPrgBcedrvnlz7W0ofE7zwIQSSGn/gY1Ml0484l7Pc46EQW3G
bnDWQu0sIJJW3MnDWKdrJdscSc8xG6PvIFqAVsJHHzXedqk/ZkYaerLL/E/pY925
yMaZM6se+E/gD2tMUsusKHWHnMmSzxtJ+4WWr5bJ1RG8Sx76UZqwEzEw4y8tEcUI
9P6tT1pl8MS186w14nfNu1bHsdVxuTv9Z/JHXUO+dDika8KMYwTIYcNCKI2mPN9E
Mk3JBeuDBHN7TBv7wHur1KUHeGK0qAJs5JtqQdRXYaLGDN/i4X1zV3bWCfH/DkY9
g4klgQa2qHsYZalAG0N0lMNglaTNSkOPkhJftRaulG3G9Vfi/1Otf5LBox6NpBB9
fuQW9FaNwVYNlFQqsu7ZbVCw4aOpQRSkAxpjj6d2KmsfKovlUPFAHHmswElygCK8
zDb07jyp3eKHmMVB7T7yWcxcZSm1nYFDOf9D0w68eHBx50vjTZsn7OqMZ4hXJcnT
bwPVRzSec84QBQTCV7fvNnDwkZnfhF/E+0HdCKfVfM/AIejHYOChaVVJCe9vipeU
dUdKqs/eVsU4iCYEtHA+vp3SRvNxpGPFKSwCTweE0ZHcAemmkSQcIcEw0Htvj8tI
5ysSoGg2baNsRfdIdNgWgzA9jZPPleHPjL795rZf0IiIdz7shzhBy0xQrf4Aq8wU
nHNG19xUP3mwkmCe4ULW+pDSPoZufGW47gPqXWDNjmRuBPUO2lNzXguZW+AkPyak
rzbjW681Ju3P6k8AforSkmvUkr+cPpeMEcl4qDpQWihpW/MCZ3Os9j2pqGDBBqbR</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>